tap "anomalyco/tap"
tap "nikitabobko/tap"
# General-purpose data compression with high compression ratio
brew "xz"
# OpenType text shaping engine
brew "harfbuzz"
# Apache Derby is an embedded relational database running on JVM
brew "derby"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Command-line fuzzy finder written in Go
brew "fzf"
# Simple terminal UI for git commands
brew "lazygit"
# Java-based project management
brew "maven"
# Deep clean and optimize your Mac
brew "mole"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# OpenAI's coding agent that runs in your terminal
cask "codex"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Drag & drop GUI designer for JavaFX
cask "scenebuilder"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@11"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@21"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@25"
